#pragma once
#include <iostream>
#include <vector>

//条目数据类型
enum Wad_Entry_Type
{
	Uncompressed, //未压缩
	Compressed, //GZip压缩
	FileRedirection, //文件重定向
	ZStandardCompressed //zstd压缩
};

//WAD文件结构信息
struct Wad_Struct
{
	/*1*/	std::string FilePath; // 文件路径
	/*2*/	std::string EntryName; // 条目名
	/*3*/	std::string xxHash_str; // 文本哈希

	/*4*/	unsigned __int64 xxHash_ulong; // 长整数哈希, 8字节
	/*5*/	unsigned int DataOffset; // 数据偏移, 4字节
	/*6*/	unsigned int CompressedSize; // 压缩后大小, 4字节
	/*7*/	unsigned int UncompressedSize; // 压缩前大小, 4字节

	/*8*/	Wad_Entry_Type Type; // 条目类型, 1字节
	/*9*/	char Duplicated;
	/*10*/	short Unknown1;
	/*11*/	unsigned __int64 SHA256; 

	/*12*/	std::string Extension; // 文件扩展名 .dds
	
	//ECDSA 256字节
	//DataChecksum 8字节
};

//头部3.0填充字节
char wad_Header_30[268] = 
{
	0x52,0x57,0x03,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
};
